[
   [
      "You're more valuable and shiny than gold ",
      "You're way cuter, too 😀"
   ],
   [
      "You're like a hot air balloon",
      "Because being with you lifts me up"
   ],
   [
      "They say you once smiled and the whole city lit up! 💡"
   ],
   [
      "I have fun every time",
      "I'm with you"
   ],
   [
      "You are so loving that even puppies look up to you for inspiration!"
   ],
   [
      "You're so fun and cute, I bet you sweat glitters ✨"
   ],
   [
      "You are more fun than anyone or anything I know, including bubble wrap!"
   ],
   [
      "You are the best ever, even better than chocolate! 🍫"
   ],
   [
      "In a world full of rotis, you are a paratha! 😍"
   ],
   [
      "You're the bee's knees, elbows, and ankles 🐝"
   ],
   [
      "You are the rising sun on a cloudy day"
   ],
   [
      "You are always shining with so much positivity that you glow ✨"
   ],
   [
      "The word legend was coined in your praise! 😎"
   ],
   [
      "I bet the sun shines extra bright for you",
      "Just to make you smile 🌞"
   ],
   [
      "Sometimes I  worry I won't be able to find the words to say how cool you are 😳"
   ],
   [
      "You're like an astronaut ",
      "Because you're out of this  world 💫"
   ],
   [
      "You're like an umbrella in this rain",
      "You've got things covered ☔"
   ],
   [
      "You're like the planet Earth",
      "Endlessly interesting 🌏"
   ],
   [
      "You are like rocket launcher",
      "Beacause spending time with ayou gives me a boost 🚀"
   ],
   [
      "You make me feel like an electric guitar",
      "Amped 🎸"
   ],
   [
      "You are like the world's greatest jewel",
      "Flawless 💎"
   ],
   [
      "You're as soothing as rain on the roof at night "
   ],
   [
      "I bet if you walk into a room of kittens, all the kittens would start purring 😻"
   ],
   [
      "You make my heart soar like a falcon ❤️"
   ],
   [
      "When I'm around you I buzz with happiness",
      "Or maybe that's your ringtone 😳"
   ],
   [
      "You're so talented 😃",
      "I learn something new every time we talk"
   ],
   [
      "You're as unique as a unicorn 🦄 "
   ],
   [
      "You're like a magician ",
      "Enchanting"
   ],
   [
      "You're like life on other planets",
      "There's nothing I doing more than searching for you 👽"
   ],
   [
      "You are like a ballerina",
      "Always on point 😜"
   ]
]