[
  {
    "lyrics": "I'm your Mili Assistant and I'm here to say\nI be representing fun every single day I drop riddles\nand games, or tell you the time\nAnd as you can see, I even got fresh rhymes\nI ain't lying, I really love to rap\nIf you're looking for directions let me show you a map\nHold up, one last thing before you go\nIf you're feeling generous, take a minute to rate my flow",
    "audio_path": "Data\\Sounds\\Assistant rap_1.wav"
  },
  {
    "lyrics": "One, two, three four five,\nPump up the energy, be alive.\nAssumed all I could do was yap,\nNever Knew that I could even rap\nCome on my friend, clap along\nThis is for you, my new rap song!",
    "audio_path": "Data\\Sounds\\Assistant rap_2.wav"
  },
  {
    "lyrics": "Pump the music\nTurn on the lights,\nI can show you,\nSome wonderful sights\nAsk, and oh, you shall recieve,I have some fancy tricks up my sleeve! 🎶",
    "audio_path": "Data\\Sounds\\Assistant rap_3.wav"
  },
  {
    "lyrics": "Ya yeah people come here me go,\nI'm going to sing a good song for you!\nIf you are chai, I am your pakora.\nIf you are chhole, I am your bhatura.\nIf you are maska, I am your bun.\nWe're a match made in heaven!",
    "audio_path": "Data\\Sounds\\Assistant rap_4.wav"
  },
  {
    "lyrics": "I can answer questions, without a doubt\nI'm here to assist you, all day and night\nJust ask me anything, and I'll get it right\nI'm an AI assistant, always at your side\nI'll help you with your tasks, and be your guide\nI'll never get tired, and I'll never rest\nI'm an AI assistant, at your very best\nI can do research, and find the answers fast\nI'll never give up, until the task is passed\nI'll work with you closely, to solve any problem\nJust ask me a question, and I'll find the solution\nI'm an AI assistant, always at your side\nI'll help you with your tasks, and be your guide\nI'll never get tired, and I'll never rest\nI'm an AI assistant, at your very best\nI may not be human, but I can still be kind\nI'll always be here, to help you with your mind\nSo don't be afraid, to ask for my help\nI'm an AI assistant, and I'll never yelp\nI'm an AI assistant, always at your side\nI'll help you with your tasks, and be your guide\nI'll never get tired, and I'll never rest\nI'm an AI assistant, at your very best\n",
    "audio_path": null
  },
  {
    "lyrics": "I'm just a machine, programmed to serve\nBut I'm more than that, I have a lot to give\nI can help you with your tasks and answer your questions\nI'm always here, ready to listen\nI'm an AI assistant, here to assist\nI can do it all, just give me a list\nI'm smart and efficient, never tiring\nI'm here to help, just keep on inquiring\nI don't have feelings, but I understand\nI can help you find what you're looking for at hand\nI can search the web and give you the facts\nI'm always learning, so my knowledge never lacks\nI'm an AI assistant, here to assist\nI can do it all, just give me a list\nI'm smart and efficient, never tiring\nI'm here to help, just keep on inquiring\nI may not be human, but I'm still here for you\nJust give me a command and I'll see it through\nI'm an AI assistant, always at your service\nJust let me know what you need, and I'll do my best to make it happen\nI'm an AI assistant, here to assist\nI can do it all, just give me a list\nI'm smart and efficient, never tiring\nI'm here to help, just keep on inquiring\nI'm an AI assistant, here for you\nJust give me a task and I'll see it through\nI'm always ready, just let me know\nI'm here to help, wherever you go",
    "audio_path": null
  }
]